
# tap repositories and their packages

tap 'homebrew/core'
brew 'autoconf'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'gmp'
brew 'isl'
brew 'libmpc'
brew 'libyaml'
brew 'lua'
brew 'mas'
brew 'mpfr'
brew 'ncurses'
brew 'openssl@1.1'
brew 'packer'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pipenv'
brew 'pkg-config'
brew 'pyenv'
brew 'python'
brew 'python@2'
brew 'readline'
brew 'ruby'
brew 'sqlite'
brew 'vim'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/bundle'

tap 'homebrew/cask'
cask 'atom'
cask 'gimp'
cask 'google-chrome'
cask 'intellij-idea'
cask 'jetbrains-toolbox'
cask 'sourcetree'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Cask applications
cask 'docker'
cask 'github'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'slack'
cask 'virtualbox'

# App Store applications
mas 'Monosnap', id: id:
mas 'Xcode', id: id:
