
# tap repositories and their packages

tap 'homebrew/core'
brew 'autoconf'
brew 'docker'
brew 'docker-compose'
brew 'gdbm'
brew 'git'
brew 'heroku'
brew 'mas'
brew 'openssl'
brew 'packer'
brew 'pipenv'
brew 'pkg-config'
brew 'pyenv'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'vim'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/bundle'

tap 'homebrew/cask'
cask 'atom'
cask 'github'
cask 'iterm2'
cask 'local-by-flywheel'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Cask applications
cask 'docker'
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'slack'
