
# tap repositories and their packages

tap 'homebrew/core'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'gmp'
brew 'libyaml'
brew 'openssl@1.1'
brew 'pcre2'
brew 'readline'
brew 'ruby'
brew 'sqlite'
brew 'xz'

tap 'homebrew/bundle'

tap 'homebrew/cask'
cask 'docker'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'intellij-idea'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'slack'
cask 'sourcetree'
cask 'visual-studio-code'

tap 'martido/homebrew-graph'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Monosnap', id: id:
mas 'Xcode', id: id:
